dours/trik-msp-usb-firmware/msp430f5510_symbols.h
// Generated by symbols.ld.to.addresses.h.pl from /home/trik/msp430-gcc-support-files/include/msp430f5510_symbols.ld


/* ============================================================================ */
/* Copyright (c) 2020, Texas Instruments Incorporated                           */
/*  All rights reserved.                                                        */
/*                                                                              */
/*  Redistribution and use in source and binary forms, with or without          */
/*  modification, are permitted provided that the following conditions          */
/*  are met:                                                                    */
/*                                                                              */
/*  *  Redistributions of source code must retain the above copyright           */
/*     notice, this list of conditions and the following disclaimer.            */
/*                                                                              */
/*  *  Redistributions in binary form must reproduce the above copyright        */
/*     notice, this list of conditions and the following disclaimer in the      */
/*     documentation and/or other materials provided with the distribution.     */
/*                                                                              */
/*  *  Neither the name of Texas Instruments Incorporated nor the names of      */
/*     its contributors may be used to endorse or promote products derived      */
/*     from this software without specific prior written permission.            */
/*                                                                              */
/*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" */
/*  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,       */
/*  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR      */
/*  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR            */
/*  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,       */
/*  EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,         */
/*  PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; */
/*  OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,    */
/*  WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR     */
/*  OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,              */
/*  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                          */
/* ============================================================================ */

/* This file supports MSP430F5510 devices. */
/* Version: 1.209 */

/************************************************************
* STANDARD BITS
************************************************************/
/************************************************************
* STATUS REGISTER BITS
************************************************************/
/************************************************************
* PERIPHERAL FILE MAP
************************************************************/
/************************************************************
* ADC10_A
************************************************************/
#define ADC10CTL0 (0x0740)
#define ADC10CTL0_L (0x0740)
#define ADC10CTL0_H (0x0741)
#define ADC10CTL1 (0x0742)
#define ADC10CTL1_L (0x0742)
#define ADC10CTL1_H (0x0743)
#define ADC10CTL2 (0x0744)
#define ADC10CTL2_L (0x0744)
#define ADC10CTL2_H (0x0745)
#define ADC10LO (0x0746)
#define ADC10LO_L (0x0746)
#define ADC10LO_H (0x0747)
#define ADC10HI (0x0748)
#define ADC10HI_L (0x0748)
#define ADC10HI_H (0x0749)
#define ADC10MCTL0 (0x074A)
#define ADC10MCTL0_L (0x074A)
#define ADC10MCTL0_H (0x074B)
#define ADC10MEM0 (0x0752)
#define ADC10MEM0_L (0x0752)
#define ADC10MEM0_H (0x0753)
#define ADC10IE (0x075A)
#define ADC10IE_L (0x075A)
#define ADC10IE_H (0x075B)
#define ADC10IFG (0x075C)
#define ADC10IFG_L (0x075C)
#define ADC10IFG_H (0x075D)
#define ADC10IV (0x075E)
#define ADC10IV_L (0x075E)
#define ADC10IV_H (0x075F)
/************************************************************
* Comparator B
************************************************************/
#define CBCTL0 (0x08C0)
#define CBCTL0_L (0x08C0)
#define CBCTL0_H (0x08C1)
#define CBCTL1 (0x08C2)
#define CBCTL1_L (0x08C2)
#define CBCTL1_H (0x08C3)
#define CBCTL2 (0x08C4)
#define CBCTL2_L (0x08C4)
#define CBCTL2_H (0x08C5)
#define CBCTL3 (0x08C6)
#define CBCTL3_L (0x08C6)
#define CBCTL3_H (0x08C7)
#define CBINT (0x08CC)
#define CBINT_L (0x08CC)
#define CBINT_H (0x08CD)
#define CBIV (0x08CE)
/*************************************************************
* CRC Module
*************************************************************/
#define CRCDI (0x0150)
#define CRCDI_L (0x0150)
#define CRCDI_H (0x0151)
#define CRCDIRB (0x0152)
#define CRCDIRB_L (0x0152)
#define CRCDIRB_H (0x0153)
#define CRCINIRES (0x0154)
#define CRCINIRES_L (0x0154)
#define CRCINIRES_H (0x0155)
#define CRCRESR (0x0156)
#define CRCRESR_L (0x0156)
#define CRCRESR_H (0x0157)
/************************************************************
* DMA_X
************************************************************/
#define DMACTL0 (0x0500)
#define DMACTL1 (0x0502)
#define DMACTL2 (0x0504)
#define DMACTL3 (0x0506)
#define DMACTL4 (0x0508)
#define DMAIV (0x050E)
#define DMA0CTL (0x0510)
#define DMA0SA (0x0512)
#define DMA0SAL (0x0512)
#define DMA0DA (0x0516)
#define DMA0DAL (0x0516)
#define DMA0SZ (0x051A)
#define DMA1CTL (0x0520)
#define DMA1SA (0x0522)
#define DMA1SAL (0x0522)
#define DMA1DA (0x0526)
#define DMA1DAL (0x0526)
#define DMA1SZ (0x052A)
#define DMA2CTL (0x0530)
#define DMA2SA (0x0532)
#define DMA2SAL (0x0532)
#define DMA2DA (0x0536)
#define DMA2DAL (0x0536)
#define DMA2SZ (0x053A)
/*************************************************************
* Flash Memory
*************************************************************/
#define FCTL1 (0x0140)
#define FCTL1_L (0x0140)
#define FCTL1_H (0x0141)
#define FCTL3 (0x0144)
#define FCTL3_L (0x0144)
#define FCTL3_H (0x0145)
#define FCTL4 (0x0146)
#define FCTL4_L (0x0146)
#define FCTL4_H (0x0147)
/************************************************************
* HARDWARE MULTIPLIER 32Bit
************************************************************/
#define MPY (0x04C0)
#define MPY_L (0x04C0)
#define MPY_H (0x04C1)
#define MPYS (0x04C2)
#define MPYS_L (0x04C2)
#define MPYS_H (0x04C3)
#define MAC (0x04C4)
#define MAC_L (0x04C4)
#define MAC_H (0x04C5)
#define MACS (0x04C6)
#define MACS_L (0x04C6)
#define MACS_H (0x04C7)
#define OP2 (0x04C8)
#define OP2_L (0x04C8)
#define OP2_H (0x04C9)
#define RESLO (0x04CA)
#define RESLO_L (0x04CA)
#define RESLO_H (0x04CB)
#define RESHI (0x04CC)
#define RESHI_L (0x04CC)
#define RESHI_H (0x04CD)
#define SUMEXT (0x04CE)
#define SUMEXT_L (0x04CE)
#define SUMEXT_H (0x04CF)
#define MPY32L (0x04D0)
#define MPY32L_L (0x04D0)
#define MPY32L_H (0x04D1)
#define MPY32H (0x04D2)
#define MPY32H_L (0x04D2)
#define MPY32H_H (0x04D3)
#define MPYS32L (0x04D4)
#define MPYS32L_L (0x04D4)
#define MPYS32L_H (0x04D5)
#define MPYS32H (0x04D6)
#define MPYS32H_L (0x04D6)
#define MPYS32H_H (0x04D7)
#define MAC32L (0x04D8)
#define MAC32L_L (0x04D8)
#define MAC32L_H (0x04D9)
#define MAC32H (0x04DA)
#define MAC32H_L (0x04DA)
#define MAC32H_H (0x04DB)
#define MACS32L (0x04DC)
#define MACS32L_L (0x04DC)
#define MACS32L_H (0x04DD)
#define MACS32H (0x04DE)
#define MACS32H_L (0x04DE)
#define MACS32H_H (0x04DF)
#define OP2L (0x04E0)
#define OP2L_L (0x04E0)
#define OP2L_H (0x04E1)
#define OP2H (0x04E2)
#define OP2H_L (0x04E2)
#define OP2H_H (0x04E3)
#define RES0 (0x04E4)
#define RES0_L (0x04E4)
#define RES0_H (0x04E5)
#define RES1 (0x04E6)
#define RES1_L (0x04E6)
#define RES1_H (0x04E7)
#define RES2 (0x04E8)
#define RES2_L (0x04E8)
#define RES2_H (0x04E9)
#define RES3 (0x04EA)
#define RES3_L (0x04EA)
#define RES3_H (0x04EB)
#define MPY32CTL0 (0x04EC)
#define MPY32CTL0_L (0x04EC)
#define MPY32CTL0_H (0x04ED)
/************************************************************
* DIGITAL I/O Port1/2 Pull up / Pull down Resistors
************************************************************/
#define PAIN (0x0200)
#define PAIN_L (0x0200)
#define PAIN_H (0x0201)
#define PAOUT (0x0202)
#define PAOUT_L (0x0202)
#define PAOUT_H (0x0203)
#define PADIR (0x0204)
#define PADIR_L (0x0204)
#define PADIR_H (0x0205)
#define PAREN (0x0206)
#define PAREN_L (0x0206)
#define PAREN_H (0x0207)
#define PADS (0x0208)
#define PADS_L (0x0208)
#define PADS_H (0x0209)
#define PASEL (0x020A)
#define PASEL_L (0x020A)
#define PASEL_H (0x020B)
#define PAIES (0x0218)
#define PAIES_L (0x0218)
#define PAIES_H (0x0219)
#define PAIE (0x021A)
#define PAIE_L (0x021A)
#define PAIE_H (0x021B)
#define PAIFG (0x021C)
#define PAIFG_L (0x021C)
#define PAIFG_H (0x021D)
#define P1IV (0x020E)
#define P2IV (0x021E)
/************************************************************
* DIGITAL I/O Port3/4 Pull up / Pull down Resistors
************************************************************/
#define PBIN (0x0220)
#define PBIN_L (0x0220)
#define PBIN_H (0x0221)
#define PBOUT (0x0222)
#define PBOUT_L (0x0222)
#define PBOUT_H (0x0223)
#define PBDIR (0x0224)
#define PBDIR_L (0x0224)
#define PBDIR_H (0x0225)
#define PBREN (0x0226)
#define PBREN_L (0x0226)
#define PBREN_H (0x0227)
#define PBDS (0x0228)
#define PBDS_L (0x0228)
#define PBDS_H (0x0229)
#define PBSEL (0x022A)
#define PBSEL_L (0x022A)
#define PBSEL_H (0x022B)
/************************************************************
* DIGITAL I/O Port5/6 Pull up / Pull down Resistors
************************************************************/
#define PCIN (0x0240)
#define PCIN_L (0x0240)
#define PCIN_H (0x0241)
#define PCOUT (0x0242)
#define PCOUT_L (0x0242)
#define PCOUT_H (0x0243)
#define PCDIR (0x0244)
#define PCDIR_L (0x0244)
#define PCDIR_H (0x0245)
#define PCREN (0x0246)
#define PCREN_L (0x0246)
#define PCREN_H (0x0247)
#define PCDS (0x0248)
#define PCDS_L (0x0248)
#define PCDS_H (0x0249)
#define PCSEL (0x024A)
#define PCSEL_L (0x024A)
#define PCSEL_H (0x024B)
/************************************************************
* DIGITAL I/O PortJ Pull up / Pull down Resistors
************************************************************/
#define PJIN (0x0320)
#define PJIN_L (0x0320)
#define PJIN_H (0x0321)
#define PJOUT (0x0322)
#define PJOUT_L (0x0322)
#define PJOUT_H (0x0323)
#define PJDIR (0x0324)
#define PJDIR_L (0x0324)
#define PJDIR_H (0x0325)
#define PJREN (0x0326)
#define PJREN_L (0x0326)
#define PJREN_H (0x0327)
#define PJDS (0x0328)
#define PJDS_L (0x0328)
#define PJDS_H (0x0329)
/************************************************************
* PORT MAPPING CONTROLLER
************************************************************/
#define PMAPKEYID (0x01C0)
#define PMAPKEYID_L (0x01C0)
#define PMAPKEYID_H (0x01C1)
#define PMAPCTL (0x01C2)
#define PMAPCTL_L (0x01C2)
#define PMAPCTL_H (0x01C3)
/************************************************************
* PORT 4 MAPPING CONTROLLER
************************************************************/
#define P4MAP01 (0x01E0)
#define P4MAP01_L (0x01E0)
#define P4MAP01_H (0x01E1)
#define P4MAP23 (0x01E2)
#define P4MAP23_L (0x01E2)
#define P4MAP23_H (0x01E3)
#define P4MAP45 (0x01E4)
#define P4MAP45_L (0x01E4)
#define P4MAP45_H (0x01E5)
#define P4MAP67 (0x01E6)
#define P4MAP67_L (0x01E6)
#define P4MAP67_H (0x01E7)
/************************************************************
* PMM - Power Management System
************************************************************/
#define PMMCTL0 (0x0120)
#define PMMCTL0_L (0x0120)
#define PMMCTL0_H (0x0121)
#define PMMCTL1 (0x0122)
#define PMMCTL1_L (0x0122)
#define PMMCTL1_H (0x0123)
#define SVSMHCTL (0x0124)
#define SVSMHCTL_L (0x0124)
#define SVSMHCTL_H (0x0125)
#define SVSMLCTL (0x0126)
#define SVSMLCTL_L (0x0126)
#define SVSMLCTL_H (0x0127)
#define SVSMIO (0x0128)
#define SVSMIO_L (0x0128)
#define SVSMIO_H (0x0129)
#define PMMIFG (0x012C)
#define PMMIFG_L (0x012C)
#define PMMIFG_H (0x012D)
#define PMMRIE (0x012E)
#define PMMRIE_L (0x012E)
#define PMMRIE_H (0x012F)
#define PM5CTL0 (0x0130)
#define PM5CTL0_L (0x0130)
#define PM5CTL0_H (0x0131)
/*************************************************************
* RAM Control Module
*************************************************************/
#define RCCTL0 (0x0158)
#define RCCTL0_L (0x0158)
#define RCCTL0_H (0x0159)
/************************************************************
* Shared Reference
************************************************************/
#define REFCTL0 (0x01B0)
#define REFCTL0_L (0x01B0)
#define REFCTL0_H (0x01B1)
/************************************************************
* Real Time Clock
************************************************************/
#define RTCCTL01 (0x04A0)
#define RTCCTL01_L (0x04A0)
#define RTCCTL01_H (0x04A1)
#define RTCCTL23 (0x04A2)
#define RTCCTL23_L (0x04A2)
#define RTCCTL23_H (0x04A3)
#define RTCPS0CTL (0x04A8)
#define RTCPS0CTL_L (0x04A8)
#define RTCPS0CTL_H (0x04A9)
#define RTCPS1CTL (0x04AA)
#define RTCPS1CTL_L (0x04AA)
#define RTCPS1CTL_H (0x04AB)
#define RTCPS (0x04AC)
#define RTCPS_L (0x04AC)
#define RTCPS_H (0x04AD)
#define RTCIV (0x04AE)
#define RTCTIM0 (0x04B0)
#define RTCTIM0_L (0x04B0)
#define RTCTIM0_H (0x04B1)
#define RTCTIM1 (0x04B2)
#define RTCTIM1_L (0x04B2)
#define RTCTIM1_H (0x04B3)
#define RTCDATE (0x04B4)
#define RTCDATE_L (0x04B4)
#define RTCDATE_H (0x04B5)
#define RTCYEAR (0x04B6)
#define RTCYEAR_L (0x04B6)
#define RTCYEAR_H (0x04B7)
#define RTCAMINHR (0x04B8)
#define RTCAMINHR_L (0x04B8)
#define RTCAMINHR_H (0x04B9)
#define RTCADOWDAY (0x04BA)
#define RTCADOWDAY_L (0x04BA)
#define RTCADOWDAY_H (0x04BB)
/************************************************************
* SFR - Special Function Register Module
************************************************************/
#define SFRIE1 (0x0100)
#define SFRIE1_L (0x0100)
#define SFRIE1_H (0x0101)
#define SFRIFG1 (0x0102)
#define SFRIFG1_L (0x0102)
#define SFRIFG1_H (0x0103)
#define SFRRPCR (0x0104)
#define SFRRPCR_L (0x0104)
#define SFRRPCR_H (0x0105)
/************************************************************
* SYS - System Module
************************************************************/
#define SYSCTL (0x0180)
#define SYSCTL_L (0x0180)
#define SYSCTL_H (0x0181)
#define SYSBSLC (0x0182)
#define SYSBSLC_L (0x0182)
#define SYSBSLC_H (0x0183)
#define SYSJMBC (0x0186)
#define SYSJMBC_L (0x0186)
#define SYSJMBC_H (0x0187)
#define SYSJMBI0 (0x0188)
#define SYSJMBI0_L (0x0188)
#define SYSJMBI0_H (0x0189)
#define SYSJMBI1 (0x018A)
#define SYSJMBI1_L (0x018A)
#define SYSJMBI1_H (0x018B)
#define SYSJMBO0 (0x018C)
#define SYSJMBO0_L (0x018C)
#define SYSJMBO0_H (0x018D)
#define SYSJMBO1 (0x018E)
#define SYSJMBO1_L (0x018E)
#define SYSJMBO1_H (0x018F)
#define SYSBERRIV (0x0198)
#define SYSBERRIV_L (0x0198)
#define SYSBERRIV_H (0x0199)
#define SYSUNIV (0x019A)
#define SYSUNIV_L (0x019A)
#define SYSUNIV_H (0x019B)
#define SYSSNIV (0x019C)
#define SYSSNIV_L (0x019C)
#define SYSSNIV_H (0x019D)
#define SYSRSTIV (0x019E)
#define SYSRSTIV_L (0x019E)
#define SYSRSTIV_H (0x019F)
/************************************************************
* Timer0_A5
************************************************************/
#define TA0CTL (0x0340)
#define TA0CCTL0 (0x0342)
#define TA0CCTL1 (0x0344)
#define TA0CCTL2 (0x0346)
#define TA0CCTL3 (0x0348)
#define TA0CCTL4 (0x034A)
#define TA0R (0x0350)
#define TA0CCR0 (0x0352)
#define TA0CCR1 (0x0354)
#define TA0CCR2 (0x0356)
#define TA0CCR3 (0x0358)
#define TA0CCR4 (0x035A)
#define TA0IV (0x036E)
#define TA0EX0 (0x0360)
/************************************************************
* Timer1_A3
************************************************************/
#define TA1CTL (0x0380)
#define TA1CCTL0 (0x0382)
#define TA1CCTL1 (0x0384)
#define TA1CCTL2 (0x0386)
#define TA1R (0x0390)
#define TA1CCR0 (0x0392)
#define TA1CCR1 (0x0394)
#define TA1CCR2 (0x0396)
#define TA1IV (0x03AE)
#define TA1EX0 (0x03A0)
/************************************************************
* Timer2_A3
************************************************************/
#define TA2CTL (0x0400)
#define TA2CCTL0 (0x0402)
#define TA2CCTL1 (0x0404)
#define TA2CCTL2 (0x0406)
#define TA2R (0x0410)
#define TA2CCR0 (0x0412)
#define TA2CCR1 (0x0414)
#define TA2CCR2 (0x0416)
#define TA2IV (0x042E)
#define TA2EX0 (0x0420)
/************************************************************
* Timer0_B7
************************************************************/
#define TB0CTL (0x03C0)
#define TB0CCTL0 (0x03C2)
#define TB0CCTL1 (0x03C4)
#define TB0CCTL2 (0x03C6)
#define TB0CCTL3 (0x03C8)
#define TB0CCTL4 (0x03CA)
#define TB0CCTL5 (0x03CC)
#define TB0CCTL6 (0x03CE)
#define TB0R (0x03D0)
#define TB0CCR0 (0x03D2)
#define TB0CCR1 (0x03D4)
#define TB0CCR2 (0x03D6)
#define TB0CCR3 (0x03D8)
#define TB0CCR4 (0x03DA)
#define TB0CCR5 (0x03DC)
#define TB0CCR6 (0x03DE)
#define TB0EX0 (0x03E0)
#define TB0IV (0x03EE)
/************************************************************
* USB
************************************************************/
#define USBKEYID (0x0900)
#define USBKEYID_L (0x0900)
#define USBKEYID_H (0x0901)
#define USBCNF (0x0902)
#define USBCNF_L (0x0902)
#define USBCNF_H (0x0903)
#define USBPHYCTL (0x0904)
#define USBPHYCTL_L (0x0904)
#define USBPHYCTL_H (0x0905)
#define USBPWRCTL (0x0908)
#define USBPWRCTL_L (0x0908)
#define USBPWRCTL_H (0x0909)
#define USBPLLCTL (0x0910)
#define USBPLLCTL_L (0x0910)
#define USBPLLCTL_H (0x0911)
#define USBPLLDIVB (0x0912)
#define USBPLLDIVB_L (0x0912)
#define USBPLLDIVB_H (0x0913)
#define USBPLLIR (0x0914)
#define USBPLLIR_L (0x0914)
#define USBPLLIR_H (0x0915)
#define USBIEPCNF_0 (0x0920)
#define USBIEPCNT_0 (0x0921)
#define USBOEPCNF_0 (0x0922)
#define USBOEPCNT_0 (0x0923)
#define USBIEPIE (0x092E)
#define USBOEPIE (0x092F)
#define USBIEPIFG (0x0930)
#define USBOEPIFG (0x0931)
#define USBVECINT (0x0932)
#define USBVECINT_L (0x0932)
#define USBVECINT_H (0x0933)
#define USBMAINT (0x0936)
#define USBMAINT_L (0x0936)
#define USBMAINT_H (0x0937)
#define USBTSREG (0x0938)
#define USBTSREG_L (0x0938)
#define USBTSREG_H (0x0939)
#define USBFN (0x093A)
#define USBFN_L (0x093A)
#define USBFN_H (0x093B)
#define USBCTL (0x093C)
#define USBIE (0x093D)
#define USBIFG (0x093E)
#define USBFUNADR (0x093F)
#define USBIEPSIZXY_7 (0x23FF)
#define USBIEPBCTY_7 (0x23FE)
#define USBIEPBBAY_7 (0x23FD)
#define USBIEPBCTX_7 (0x23FA)
#define USBIEPBBAX_7 (0x23F9)
#define USBIEPCNF_7 (0x23F8)
#define USBIEPSIZXY_6 (0x23F7)
#define USBIEPBCTY_6 (0x23F6)
#define USBIEPBBAY_6 (0x23F5)
#define USBIEPBCTX_6 (0x23F2)
#define USBIEPBBAX_6 (0x23F1)
#define USBIEPCNF_6 (0x23F0)
#define USBIEPSIZXY_5 (0x23EF)
#define USBIEPBCTY_5 (0x23EE)
#define USBIEPBBAY_5 (0x23ED)
#define USBIEPBCTX_5 (0x23EA)
#define USBIEPBBAX_5 (0x23E9)
#define USBIEPCNF_5 (0x23E8)
#define USBIEPSIZXY_4 (0x23E7)
#define USBIEPBCTY_4 (0x23E6)
#define USBIEPBBAY_4 (0x23E5)
#define USBIEPBCTX_4 (0x23E2)
#define USBIEPBBAX_4 (0x23E1)
#define USBIEPCNF_4 (0x23E0)
#define USBIEPSIZXY_3 (0x23DF)
#define USBIEPBCTY_3 (0x23DE)
#define USBIEPBBAY_3 (0x23DD)
#define USBIEPBCTX_3 (0x23DA)
#define USBIEPBBAX_3 (0x23D9)
#define USBIEPCNF_3 (0x23D8)
#define USBIEPSIZXY_2 (0x23D7)
#define USBIEPBCTY_2 (0x23D6)
#define USBIEPBBAY_2 (0x23D5)
#define USBIEPBCTX_2 (0x23D2)
#define USBIEPBBAX_2 (0x23D1)
#define USBIEPCNF_2 (0x23D0)
#define USBIEPSIZXY_1 (0x23CF)
#define USBIEPBCTY_1 (0x23CE)
#define USBIEPBBAY_1 (0x23CD)
#define USBIEPBCTX_1 (0x23CA)
#define USBIEPBBAX_1 (0x23C9)
#define USBIEPCNF_1 (0x23C8)
#define USBOEPSIZXY_7 (0x23BF)
#define USBOEPBCTY_7 (0x23BE)
#define USBOEPBBAY_7 (0x23BD)
#define USBOEPBCTX_7 (0x23BA)
#define USBOEPBBAX_7 (0x23B9)
#define USBOEPCNF_7 (0x23B8)
#define USBOEPSIZXY_6 (0x23B7)
#define USBOEPBCTY_6 (0x23B6)
#define USBOEPBBAY_6 (0x23B5)
#define USBOEPBCTX_6 (0x23B2)
#define USBOEPBBAX_6 (0x23B1)
#define USBOEPCNF_6 (0x23B0)
#define USBOEPSIZXY_5 (0x23AF)
#define USBOEPBCTY_5 (0x23AE)
#define USBOEPBBAY_5 (0x23AD)
#define USBOEPBCTX_5 (0x23AA)
#define USBOEPBBAX_5 (0x23A9)
#define USBOEPCNF_5 (0x23A8)
#define USBOEPSIZXY_4 (0x23A7)
#define USBOEPBCTY_4 (0x23A6)
#define USBOEPBBAY_4 (0x23A5)
#define USBOEPBCTX_4 (0x23A2)
#define USBOEPBBAX_4 (0x23A1)
#define USBOEPCNF_4 (0x23A0)
#define USBOEPSIZXY_3 (0x239F)
#define USBOEPBCTY_3 (0x239E)
#define USBOEPBBAY_3 (0x239D)
#define USBOEPBCTX_3 (0x239A)
#define USBOEPBBAX_3 (0x2399)
#define USBOEPCNF_3 (0x2398)
#define USBOEPSIZXY_2 (0x2397)
#define USBOEPBCTY_2 (0x2396)
#define USBOEPBBAY_2 (0x2395)
#define USBOEPBCTX_2 (0x2392)
#define USBOEPBBAX_2 (0x2391)
#define USBOEPCNF_2 (0x2390)
#define USBOEPSIZXY_1 (0x238F)
#define USBOEPBCTY_1 (0x238E)
#define USBOEPBBAY_1 (0x238D)
#define USBOEPBCTX_1 (0x238A)
#define USBOEPBBAX_1 (0x2389)
#define USBOEPCNF_1 (0x2388)
#define USBSUBLK (0x2380)
#define USBIEP0BUF (0x2378)
#define USBOEP0BUF (0x2370)
#define USBTOPBUFF (0x236F)
#define USBSTABUFF (0x1C00)
/************************************************************
* UNIFIED CLOCK SYSTEM
************************************************************/
#define UCSCTL0 (0x0160)
#define UCSCTL0_L (0x0160)
#define UCSCTL0_H (0x0161)
#define UCSCTL1 (0x0162)
#define UCSCTL1_L (0x0162)
#define UCSCTL1_H (0x0163)
#define UCSCTL2 (0x0164)
#define UCSCTL2_L (0x0164)
#define UCSCTL2_H (0x0165)
#define UCSCTL3 (0x0166)
#define UCSCTL3_L (0x0166)
#define UCSCTL3_H (0x0167)
#define UCSCTL4 (0x0168)
#define UCSCTL4_L (0x0168)
#define UCSCTL4_H (0x0169)
#define UCSCTL5 (0x016A)
#define UCSCTL5_L (0x016A)
#define UCSCTL5_H (0x016B)
#define UCSCTL6 (0x016C)
#define UCSCTL6_L (0x016C)
#define UCSCTL6_H (0x016D)
#define UCSCTL7 (0x016E)
#define UCSCTL7_L (0x016E)
#define UCSCTL7_H (0x016F)
#define UCSCTL8 (0x0170)
#define UCSCTL8_L (0x0170)
#define UCSCTL8_H (0x0171)
/************************************************************
* USCI A0
************************************************************/
#define UCA0CTLW0 (0x05C0)
#define UCA0CTLW0_L (0x05C0)
#define UCA0CTLW0_H (0x05C1)
#define UCA0BRW (0x05C6)
#define UCA0BRW_L (0x05C6)
#define UCA0BRW_H (0x05C7)
#define UCA0MCTL (0x05C8)
#define UCA0STAT (0x05CA)
#define UCA0RXBUF (0x05CC)
#define UCA0TXBUF (0x05CE)
#define UCA0ABCTL (0x05D0)
#define UCA0IRCTL (0x05D2)
#define UCA0IRCTL_L (0x05D2)
#define UCA0IRCTL_H (0x05D3)
#define UCA0ICTL (0x05DC)
#define UCA0ICTL_L (0x05DC)
#define UCA0ICTL_H (0x05DD)
#define UCA0IV (0x05DE)
/************************************************************
* USCI B0
************************************************************/
#define UCB0CTLW0 (0x05E0)
#define UCB0CTLW0_L (0x05E0)
#define UCB0CTLW0_H (0x05E1)
#define UCB0BRW (0x05E6)
#define UCB0BRW_L (0x05E6)
#define UCB0BRW_H (0x05E7)
#define UCB0STAT (0x05EA)
#define UCB0RXBUF (0x05EC)
#define UCB0TXBUF (0x05EE)
#define UCB0I2COA (0x05F0)
#define UCB0I2COA_L (0x05F0)
#define UCB0I2COA_H (0x05F1)
#define UCB0I2CSA (0x05F2)
#define UCB0I2CSA_L (0x05F2)
#define UCB0I2CSA_H (0x05F3)
#define UCB0ICTL (0x05FC)
#define UCB0ICTL_L (0x05FC)
#define UCB0ICTL_H (0x05FD)
#define UCB0IV (0x05FE)
/************************************************************
* USCI A1
************************************************************/
#define UCA1CTLW0 (0x0600)
#define UCA1CTLW0_L (0x0600)
#define UCA1CTLW0_H (0x0601)
#define UCA1BRW (0x0606)
#define UCA1BRW_L (0x0606)
#define UCA1BRW_H (0x0607)
#define UCA1MCTL (0x0608)
#define UCA1STAT (0x060A)
#define UCA1RXBUF (0x060C)
#define UCA1TXBUF (0x060E)
#define UCA1ABCTL (0x0610)
#define UCA1IRCTL (0x0612)
#define UCA1IRCTL_L (0x0612)
#define UCA1IRCTL_H (0x0613)
#define UCA1ICTL (0x061C)
#define UCA1ICTL_L (0x061C)
#define UCA1ICTL_H (0x061D)
#define UCA1IV (0x061E)
/************************************************************
* USCI B1
************************************************************/
#define UCB1CTLW0 (0x0620)
#define UCB1CTLW0_L (0x0620)
#define UCB1CTLW0_H (0x0621)
#define UCB1BRW (0x0626)
#define UCB1BRW_L (0x0626)
#define UCB1BRW_H (0x0627)
#define UCB1STAT (0x062A)
#define UCB1RXBUF (0x062C)
#define UCB1TXBUF (0x062E)
#define UCB1I2COA (0x0630)
#define UCB1I2COA_L (0x0630)
#define UCB1I2COA_H (0x0631)
#define UCB1I2CSA (0x0632)
#define UCB1I2CSA_L (0x0632)
#define UCB1I2CSA_H (0x0633)
#define UCB1ICTL (0x063C)
#define UCB1ICTL_L (0x063C)
#define UCB1ICTL_H (0x063D)
#define UCB1IV (0x063E)
/************************************************************
* WATCHDOG TIMER A
************************************************************/
#define WDTCTL (0x015C)
#define WDTCTL_L (0x015C)
#define WDTCTL_H (0x015D)
/************************************************************
* TLV Descriptors
************************************************************/
/************************************************************
* Interrupt Vectors (offset from 0xFF80)
************************************************************/
/************************************************************
* End of Modules
************************************************************/
